The first part of the assignment is:

Characterisation of the data set: size; number of attributes; has/does not have missing values, number of observations etc. and what these Characterisation mean.

For this reason I am iporting the dataset with libraries and check what are the specific

In [3]:
import pandas as pd
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [4]:
aps_df= pd.read_csv("aps_failure_set.csv")

In [5]:
aps_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60000 entries, 0 to 59999
Columns: 171 entries, class to eg_000
dtypes: int64(1), object(170)
memory usage: 78.3+ MB

In [7]:
aps_df=pd.read_csv("aps_failure_set.csv")
print("The data set has {} rows and {} columns".format(aps_df.shape[0], aps_df.shape[1]))
display(aps_df.describe())
display(aps_df.head())
display(aps_df.dtypes.value_counts())

The data set has 60000 rows and 171 columns

             aa_000
count  6.000000e+04
mean   5.933650e+04
std    1.454301e+05
min    0.000000e+00
25%    8.340000e+02
50%    3.077600e+04
75%    4.866800e+04
max    2.746564e+06

,class,aa_000,ab_000,ac_000,ad_000,ae_000,af_000,ag_000,ag_001,ag_002,...,ee_002,ee_003,ee_004,ee_005,ee_006,ee_007,ee_008,ee_009,ef_000,eg_000
0,neg,76698,na,2130706438,280,0,0,0,0,0,...,1240520,493384,721044,469792,339156,157956,73224,0,0,0
1,neg,33058,na,0,na,0,0,0,0,0,...,421400,178064,293306,245416,133654,81140,97576,1500,0,0
2,neg,41040,na,228,100,0,0,0,0,0,...,277378,159812,423992,409564,320746,158022,95128,514,0,0
3,neg,12,0,70,66,0,10,0,0,0,...,240,46,58,44,10,0,0,0,4,32
4,neg,60874,na,1368,458,0,0,0,0,0,...,622012,229790,405298,347188,286954,311560,433954,1218,0,0

object    170
int64       1
dtype: int64

after this I can identify that our dataset has 6000 rows and 171 columns so in this dataset there are 6000 observations and 171 feautures ( attributes)

check for duplicate that I can see are 0:

In [8]:
aps_df.duplicated().sum()

0

Now I want to see if there are any null values:

In [10]:
aps_df.isnull().sum()

class     0
aa_000    0
ab_000    0
ac_000    0
ad_000    0
         ..
ee_007    0
ee_008    0
ee_009    0
ef_000    0
eg_000    0
Length: 171, dtype: int64

In [11]:
aps_df.duplicated().sum()

0

From here I will check if there are unique values or values that are not described. I can already check before when i did the function describe that some of them are "na" so that why I need to check this in order to strat cleaning my data